{
    "Meta": {
        "title": "Csaba Csóka - Portfolio Website",
        "description": "hu"
    },
    "Navbar": {

    },
    "AboutMe": {
        "header": "ABOUT ME",
        "name": "Csaba Csóka",
        "title": "College student",
        "introduction": "Welcome to my website! I am currently studying Computer Science BSc at the Faculty of Information Technology, University of Pannonia. I have been consciously preparing for this career since high school: first earning a qualification as a Computer System Maintenance Technician, then as a Software Developer and Tester. Since then, I have been continuously expanding my knowledge through university studies, personal projects, and online courses. My goal is to complement my theoretical knowledge with practical experience, building up-to-date and solid foundations for future challenges. I am particularly interested in web and mobile application development. Precision, high-quality work, and openness to teamwork are especially important to me. I have good collaboration and organizational skills, and I plan and execute my tasks efficiently. I believe that continuous learning and hands-on experience are essential for growth, which is why my portfolio showcases projects that best reflect my interests, development path, and professional goals."
    },
    "Services": {
        "header": "SERVICES",
        "service_webdev_name": "Website and Web Application Development",
        "service_webdev_description": "Development of modern websites and web applications tailored to individual needs. Whether it's a portfolio site, business system, or interactive user interface, I work with modern technologies and responsive design. I handle the entire development process from planning through implementation to optimization. My main goal is to deliver a fast, secure, and easy-to-use end product.",
        "service_discord_name": "Discord Bot Development",
        "service_discord_description": "Development of custom Discord bots with automated functions, moderation tools, and game integrations. The bots are built for reliable performance, scalable backend, and easy-to-use commands, suitable for both small communities and larger servers.",
        "service_mta_name": "Multi Theft Auto: San Andreas Server Development",
        "service_mta_description": "Development of customized MTA:SA servers with unique game modes, user interfaces, systems, and integration with external applications (such as premium-rate call systems, Discord servers, or API connections). I primarily work with custom scripts written from scratch."
    },
    "Technologies": {
        "header": "TECHNOLOGIES"
    },
    "Qualifications": {
        "header": "QUALIFICATIONS",
        "ongoing": "In progress",
        "comptech": "Computer systems maintenance technician",
        "softdev": "Software developer and tester",
        "compsci": "Computer science BSc"
    },
    "Accomplishments": {
        "header": "ACCOMPLISHMENTS",
        "1st": "1st place",
        "2nd": "2nd place",
        "3rd": "3rd place",
        "special": "Special prize"
    },
    "Projects": {
        "header": "PROJECTS",
        "canopener": "For the Techtogether engineering competition held in the spring of 2025, we developed a web application designed to display data from in-vehicle communication systems (CAN). The system is capable of handling multiple data sources simultaneously and includes a playback feature that allows for time-based analysis of previously recorded data. My responsibility in the project was the design and implementation of the user interface. The completed application was awarded a special prize by msg Plaut.",
        "reserveit": "We developed a website that enables businesses to easily schedule appointments for their clients. Users can register, create their own business profiles, and track their scheduled appointments. Business owners can also add employees who are authorized to manage and assign appointments to clients. The project was completed by two of us, with my partner handling the design tasks and me taking care of the programming work.",
        "dblock": "The website was developed by a team of five based on a predefined example. The project was carried out for an Italian company within the framework of the Erasmus+ program. Subsequently, I also completed the project independently, dedicating approximately 18 hours to the task.",
        "mhp": "The server is built on the Multi Theft Auto: San Andreas platform and, at the time of stepping back from my active development role, featured two game modes: Hot Pursuit, where players form one- or two-person teams to pursue a designated target team, and Clan War, where two teams compete to capture strategic points on the map. During the development process, I was responsible for establishing the server’s technical foundation, designing and implementing the initial user interfaces, and developing various supporting systems such as the automated handling of premium-rate phone calls, Discord bot and webhook integration, and the encryption of vehicle files.",
        "acsoka": "My portfolio website showcasing the technologies I have mastered, the projects I have completed, and my achievements to date."
    }
}