{
    "Meta": {
        "title": "Csóka Csaba - Portfólió Weboldal",
        "description": "hu"
    },
    "Navbar": {

    },
    "AboutMe": {
        "header": "RÓLAM",
        "name": "Csóka Csaba",
        "title": "Egyetemi hallgató",
        "introduction": "Üdvözlöm weboldalamon! Jelenleg a Pannon Egyetem Műszaki Informatikai Karán tanulok Programtervező Informatikus BSc szakon. Már középiskolában is tudatosan készültem erre a pályára: Számítógépes rendszerkarbantartó, majd Szoftverfejlesztő és -tesztelő képesítést szereztem. Azóta is folyamatosan bővítem ismereteimet egyetemi tanulmányok, otthoni projektek és online kurzusok révén. Célom, hogy elméleti tudásomat gyakorlati tapasztalattal kiegészítve naprakész, stabil alapokat teremtsek a jövőbeli kihívásokhoz. Kiemelten érdekel a web- és mobilalkalmazás-fejlesztés. Fontos számomra a precizitás, az igényes munkavégzés és a csapatmunkára való nyitottság. Jó együttműködési készséggel és szervezőképességgel rendelkezem, feladataimat hatékonyan tervezem és végzem. Hiszek abban, hogy a folyamatos tanulás és a gyakorlati tapasztalat elengedhetetlen a fejlődéshez, ezért portfóliómban olyan projekteket mutatok be, amelyek legjobban tükrözik érdeklődésemet, fejlődési irányomat és szakmai céljaimat."
    },
    "Services": {
        "header": "SZOLGÁLTATÁSOK",
        "service_webdev_name": "Weboldal- és webalkalmazás-fejlesztés",
        "service_webdev_description": "Modern, egyedi igényekre szabott weboldalak és webalkalmazások fejlesztése. Legyen szó portfólió oldalról, üzleti rendszerről vagy interaktív felhasználói felületről, modern technológiákkal és reszponzív kialakítással dolgozom. A teljes fejlesztési folyamatot vállalom a tervezéstől a megvalósításon át az optimalizálásig. Legfőbb célom, hogy a végeredmény gyors, biztonságos és könnyen kezelhető legyen.",
        "service_discord_name": "Discord-bot fejlesztés",
        "service_discord_description": "Egyedi igényekre szabott Discord-botok fejlesztése automatizált funkciókkal, moderációs eszközökkel, játék integrációkkal. A botokat megbízható működéssel, skálázható háttérrel és könnyen kezelhető parancsokkal készítem el, akár kisebb közösségek, akár nagyobb szerverek számára.",
        "service_mta_name": "Multi Theft Auto: San Andreas-szerver fejlesztés",
        "service_mta_description": "Testreszabott MTA:SA szerverek fejlesztése egyedi játékmódokkal, felhasználói felületekkel, rendszerekkel és külső alkalmazások integrációjával (például emelt díjas hívásrendszer, Discord-szerver vagy API-összekötés). Főként nulláról írt, egyedi scriptekkel dolgozom."
    },
    "Technologies": {
        "header": "TECHNOLÓGIÁK"
    },
    "Qualifications": {
        "header": "KÉPESÍTÉSEK",
        "ongoing": "Folyamatban",
        "comptech": "Számítógépes rendszerkarbantartó",
        "softdev": "Szoftverfejlesztő és -tesztelő",
        "compsci": "Programtervező informatikus BSc"
    },
    "Accomplishments": {
        "header": "EREDMÉNYEK",
        "1st": "1. helyezett",
        "2nd": "2. helyezett",
        "3rd": "3. helyezett",
        "special": "Különdíj"
    },
    "Projects": {
        "header": "PROJEKTEK",
        "canopener": "A 2025 tavaszán megrendezett Techtogether mérnöki versenyre egy olyan webes alkalmazást fejlesztettünk, amely járművek belső adatkommunikációs rendszeréből (CAN) származó információk megjelenítésére szolgál. A rendszer képes egyszerre több adatforrást kezelni, valamint visszajátszási funkcióval is rendelkezik, amely lehetővé teszi a korábban rögzített adatok időalapú elemzését. A projekt során a felhasználói felület tervezése és megvalósítása az én feladatom volt. Az elkészült alkalmazás elnyerte az msg Plaut által felajánlott különdíjat.",
        "reserveit": "Egy olyan weboldal fejlesztésén dolgoztunk, amely lehetővé teszi vállalkozások számára, hogy egyszerűen kioszthassanak időpontokat ügyfeleiknek. A felhasználók regisztrálhatnak, létrehozhatják saját vállalkozásukat, valamint nyomon követhetik a kijelölt időpontjaikat. A vállalkozások tulajdonosai továbbá dolgozókat vehetnek fel, akik szintén kezelhetik és kioszthatják az időpontokat az ügyfelek számára. A projektet ketten készítettük el, ahol társam a design feladatokat vállalta, én pedig a programozási munkálatokat végeztem.",
        "dblock": "A weboldalt egy öttagú csoportban kellett elkészítenünk egy előre megadott példa alapján. A fejlesztést egy olasz vállalat számára valósítottuk meg az Erasmus+ program keretében. Ezt követően a projektet önállóan is elkészítettem, melyre körülbelül 18 óra munkát fordítottam.",
        "mhp": "A szerver a Multi Theft Auto: San Andreas platformra épül, és az aktív fejlesztői szerepkörömtől való visszalépésem időpontjában két játékmódot tartalmazott: Hot Pursuit, amelyben a játékosok egy- vagy kétfős csapatokban üldöznek egy kiválasztott célcsapatot, valamint Clan War, ahol két csapat verseng a pályán található stratégiai pontok elfoglalásáért. A fejlesztés során felelősségi körömbe tartozott a szerver technikai alapjainak kialakítása, a kezdeti felhasználói felületek tervezése és implementálása, továbbá különféle kisebb rendszerek megvalósítása, úgymint: emelt díjas hívások automatikus kezelése, Discord bot és webhook integráció, járműfájlok titkosítása.",
        "acsoka": "Portfólió weboldalam, amely bemutatja az általam elsajátított technológiákat, megvalósított projektjeimet és eddigi eredményeimet."
    }
}